Mon Oct 16 11:44:59 EDT 2000
Password: 
1>    
2> use mgd
1> 
2> checkpoint
1> 
2> drop table MGI_dbinfo
Msg 3701, Level 11, State 1:
Server 'MGD', Line 2:
Cannot drop the table 'MGI_dbinfo', because it doesn't exist in the system
catalogs.
1> 
2> create table MGI_dbinfo (
3>         public_version  varchar(30) not null,
4>         product_name    varchar(30) not null,
5>         schema_version  varchar(30) not null,
6>         lastdump_date   datetime not null,
7>         creation_date   datetime not null,
8>         modification_date datetime not null
9> )
10> on mgd_seg_0
1> 
2> /* defaults */
3> 
4> exec sp_bindefault current_date_default, "MGI_dbinfo.lastdump_date"
Default bound to column.
(return status = 0) 
1> 
2> exec sp_bindefault current_date_default, "MGI_dbinfo.creation_date"
Default bound to column.
(return status = 0) 
1> 
2> exec sp_bindefault current_date_default, "MGI_dbinfo.modification_date"
Default bound to column.
(return status = 0) 
1> 
2> /* keys */
3> 
4> sp_primarykey MGI_dbinfo, public_version
New primary key added.
(return status = 0) 
1> 
2> /* indexes */
3> 
4> /* get rid of MGD_LastLoad table */
5> 
6> drop table MGD_LastLoad
1> 
2> /* set permissions */
3> 
4> grant select on MGI_dbinfo to public
1> 
2> checkpoint
Password: 

Starting copy...

1 rows copied.
Clock Time (ms.): total = 1  Avg = 1 (1000.00 rows per sec.)
Mon Oct 16 11:45:00 EDT 2000
Password: 
1>    
2> use nomen
1> 
2> checkpoint
1> 
2> drop table MGI_dbinfo
Msg 3701, Level 11, State 1:
Server 'MGD', Line 2:
Cannot drop the table 'MGI_dbinfo', because it doesn't exist in the system
catalogs.
1> 
2> create table MGI_dbinfo (
3>         public_version  varchar(30) not null,
4>         product_name    varchar(30) not null,
5>         schema_version  varchar(30) not null,
6>         lastdump_date   datetime not null,
7>         creation_date   datetime not null,
8>         modification_date datetime not null
9> )
10> 
1> 
2> /* defaults */
3> 
4> exec sp_bindefault current_date_default, "MGI_dbinfo.lastdump_date"
Default bound to column.
(return status = 0) 
1> 
2> exec sp_bindefault current_date_default, "MGI_dbinfo.creation_date"
Default bound to column.
(return status = 0) 
1> 
2> exec sp_bindefault current_date_default, "MGI_dbinfo.modification_date"
Default bound to column.
(return status = 0) 
1> 
2> /* keys */
3> 
4> sp_primarykey MGI_dbinfo, public_version
New primary key added.
(return status = 0) 
1> 
2> /* indexes */
3> 
4> /* get rid of MGD_LastLoad table */
5> 
6> drop table MGD_LastLoad
Msg 3701, Level 11, State 1:
Server 'MGD', Line 6:
Cannot drop the table 'MGD_LastLoad', because it doesn't exist in the system
catalogs.
1> 
2> /* set permissions */
3> 
4> grant select on MGI_dbinfo to public
1> 
2> checkpoint
Password: 

Starting copy...

1 rows copied.
Clock Time (ms.): total = 1  Avg = 1 (1000.00 rows per sec.)
Mon Oct 16 11:45:01 EDT 2000
Password: 
1>    
2> use strains
1> 
2> checkpoint
1> 
2> drop table MGI_dbinfo
Msg 3701, Level 11, State 1:
Server 'MGD', Line 2:
Cannot drop the table 'MGI_dbinfo', because it doesn't exist in the system
catalogs.
1> 
2> create table MGI_dbinfo (
3>         public_version  varchar(30) not null,
4>         product_name    varchar(30) not null,
5>         schema_version  varchar(30) not null,
6>         lastdump_date   datetime not null,
7>         creation_date   datetime not null,
8>         modification_date datetime not null
9> )
10> 
1> 
2> /* defaults */
3> 
4> exec sp_bindefault current_date_default, "MGI_dbinfo.lastdump_date"
Default bound to column.
(return status = 0) 
1> 
2> exec sp_bindefault current_date_default, "MGI_dbinfo.creation_date"
Default bound to column.
(return status = 0) 
1> 
2> exec sp_bindefault current_date_default, "MGI_dbinfo.modification_date"
Default bound to column.
(return status = 0) 
1> 
2> /* keys */
3> 
4> sp_primarykey MGI_dbinfo, public_version
New primary key added.
(return status = 0) 
1> 
2> /* indexes */
3> 
4> /* get rid of MGD_LastLoad table */
5> 
6> drop table MGD_LastLoad
Msg 3701, Level 11, State 1:
Server 'MGD', Line 6:
Cannot drop the table 'MGD_LastLoad', because it doesn't exist in the system
catalogs.
1> 
2> /* set permissions */
3> 
4> grant select on MGI_dbinfo to public
1> 
2> checkpoint
Password: 
Server Message: MGD - Msg 4806, Level 16, State 1:
You cannot run the non-logged version of bulk copy in this database. Please check with the DBO.

CTLIB Message:  - L0/O0/S0/N0/0/0:
blk_init(): blk layer: CT library error: Failed when CT_Lib routine ct_results() called.
blk_init failed.
Mon Oct 16 11:45:02 EDT 2000
Password: 
1>    
2> use wts
1> 
2> checkpoint
1> 
2> drop table MGI_dbinfo
Msg 3701, Level 11, State 1:
Server 'MGD', Line 2:
Cannot drop the table 'MGI_dbinfo', because it doesn't exist in the system
catalogs.
1> 
2> create table MGI_dbinfo (
3>         public_version  varchar(30) not null,
4>         product_name    varchar(30) not null,
5>         schema_version  varchar(30) not null,
6>         lastdump_date   datetime not null,
7>         creation_date   datetime not null,
8>         modification_date datetime not null
9> )
10> 
1> 
2> /* defaults */
3> 
4> exec sp_bindefault current_date_default, "MGI_dbinfo.lastdump_date"
Msg 17342, Level 16, State 1:
Server 'MGD', Procedure 'sp_bindefault', Line 117:
No such default exists.  You must create the default first.
(return status = 1) 
1> 
2> exec sp_bindefault current_date_default, "MGI_dbinfo.creation_date"
Msg 17342, Level 16, State 1:
Server 'MGD', Procedure 'sp_bindefault', Line 117:
No such default exists.  You must create the default first.
(return status = 1) 
1> 
2> exec sp_bindefault current_date_default, "MGI_dbinfo.modification_date"
Msg 17342, Level 16, State 1:
Server 'MGD', Procedure 'sp_bindefault', Line 117:
No such default exists.  You must create the default first.
(return status = 1) 
1> 
2> /* keys */
3> 
4> sp_primarykey MGI_dbinfo, public_version
New primary key added.
(return status = 0) 
1> 
2> /* indexes */
3> 
4> /* get rid of MGD_LastLoad table */
5> 
6> drop table MGD_LastLoad
Msg 3701, Level 11, State 1:
Server 'MGD', Line 6:
Cannot drop the table 'MGD_LastLoad', because it doesn't exist in the system
catalogs.
1> 
2> /* set permissions */
3> 
4> grant select on MGI_dbinfo to public
1> 
2> checkpoint
Password: 
Server Message: MGD - Msg 4806, Level 16, State 1:
You cannot run the non-logged version of bulk copy in this database. Please check with the DBO.

CTLIB Message:  - L0/O0/S0/N0/0/0:
blk_init(): blk layer: CT library error: Failed when CT_Lib routine ct_results() called.
blk_init failed.
Mon Oct 16 11:45:02 EDT 2000
Mon Oct 16 11:45:02 EDT 2000
